parsing-tech-log/src/Catalogs/ФайлыЗамера/ФайлыЗамера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФайлыЗамера</name>
  <owners>Catalog.Замеры</owners>
  <attributes>
    <name>ДатаФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

parsing-tech-log/src/Enums/ТипыЗамеров/ТипыЗамеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗамеров</name>
  <enumValues>
    <name>ТехнологическийЖурнал</name>
  </enumValues>
  <enumValues>
    <name>PerfomanceMonitor</name>
  </enumValues>
  <enumValues>
    <name>Произвольный</name>
  </enumValues>
</mdclass:Enum>

parsing-tech-log/src/Catalogs/ФайлыЗамера/ManagerModule.bsl
Функция ПолучитьФайлПоПолномуИмени(ЗНАЧ Замер, ЗНАЧ ПолноеИмяФайла) Экспорт
	ТипЗамера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Замер,"ТипЗамера");
	ПолноеИмяМассив = СтрРазделить(ПолноеИмяФайла, "\");
	Если ПолноеИмяМассив.Количество()>1 Тогда
		ПоследняяЧасть = ПолноеИмяМассив[ПолноеИмяМассив.ВГраница()-1] + "\" + ПолноеИмяМассив[ПолноеИмяМассив.ВГраница()];
	Иначе
		ПоследняяЧасть = ПолноеИмяФайла;
	КонецЕсли;
	ИмяБезРасширения = "";
	Если НЕ ТипЗамера=ПредопределенноеЗначение("Перечисление.ТипыЗамеров.Произвольный") Тогда
		ИмяБезРасширения = Лев(ПолноеИмяМассив[ПолноеИмяМассив.ВГраница()],8);
		Если ТипЗамера=ПредопределенноеЗначение("Перечисление.ТипыЗамеров.PerfomanceMonitor") Тогда
			ИмяБезРасширения = Прав(ПолноеИмяМассив[ПолноеИмяМассив.ВГраница()],12);
			ИмяБезРасширения = Лев(ИмяБезРасширения,8);
		КонецЕсли;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФайлыЗамера.Ссылка
	|ИЗ
	|	Справочник.ФайлыЗамера КАК ФайлыЗамера
	|ГДЕ
	|	ФайлыЗамера.Владелец = &Замер
	|	И ФайлыЗамера.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ПоследняяЧасть);
	Запрос.УстановитьПараметр("Замер", Замер);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ФайлОбъект = Справочники.ФайлыЗамера.СоздатьЭлемент();
		ФайлОбъект.Наименование = ПоследняяЧасть;
		ФайлОбъект.Владелец = Замер;
		ФайлОбъект.ДатаФайла = ?(ИмяБезРасширения="","",ОбновлениеДанныхРегламентное.ПолучитьПериодПоИмениФайла(ИмяБезРасширения));
		ФайлОбъект.Записать();
		Результат = ФайлОбъект.Ссылка;
	Иначе
		Результат = РезультатЗапроса.Выгрузить()[0].Ссылка;
	КонецЕсли;
	Возврат Результат;
КонецФункции
